# GetInitialIntensity Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightType..::..GetInitialIntensity Method
LightType Class See Also
---
Return a copy of an object derived from InitialIntensity
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public InitialIntensity GetInitialIntensity()
```

Visual Basic
---
```text
Public Function GetInitialIntensity As InitialIntensity
```

Visual C++
---
```text
public:
InitialIntensity^ GetInitialIntensity()
```

# See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace